Revit 2027 API
Toposolid.Create(Document, IList<XYZ>, ElementId, ElementId) Method
 Creates a new instance of Toposolid within the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Toposolid Create(
	Document document,
	IList<XYZ> points,
	ElementId topoTypeId,
	ElementId levelId
)
Public Shared Function Create (
	document As Document,
	points As IList(Of XYZ),
	topoTypeId As ElementId,
	levelId As ElementId
) As Toposolid
public:
static Toposolid^ Create(
	Document^ document,
	IList<XYZ^>^ points,
	ElementId^ topoTypeId,
	ElementId^ levelId
)
static member Create :
        document : Document *
        points : IList<XYZ> *
        topoTypeId : ElementId *
        levelId : ElementId -> Toposolid
Parameters
document Document
 The document in which the new Toposolid is created.
points IList<XYZ>
 An array of points that used to construct the top face of the Toposolid.
topoTypeId ElementId
 Id of the Toposolid type to be used by the new Toposolid.
levelId ElementId
 Id of the level on which the Toposolid is to be placed.
Return Value
Toposolid
 A new Toposolid object within the project if successful.
Exceptions
Exception | Condition
ArgumentException |  The input point array size is less than 3. -or- The ElementId levelId is not a Level. -or- Toposolid type is not valid for this Toposolid. -or- Input curves build invalid sketch. -or- Failed to create curve elements.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Cannot generate a sketch. -or- Failed to create new element.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
Toposolid Class
Create Overload
Autodesk.Revit.DB Namespace